In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['H', 'I', 'J', 'K'])

In [3]:
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
df.loc['E']

H    0.190794
I    1.978757
J    2.605967
K    0.683509
Name: E, dtype: float64

In [7]:
df.all()

H    True
I    True
J    True
K    True
dtype: bool

In [8]:
df.any()

H    True
I    True
J    True
K    True
dtype: bool

In [10]:
df.new = df.copy

In [11]:
df.new

<bound method NDFrame.copy of           H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509>

In [12]:
student = {'name': 'Jose', 'school':'Computing', 'grades':(66,77,88)}

In [13]:
class Store:
    def __init__(self):
        # You'll need 'name' as an argument to this method.
        # Then, initialise 'self.name' to be the argument, and 'self.items' to be an empty list.
        self.name = name
        self.items = []
    
    def add_item(self, name, price):
        # Create a dictionary with keys name and price, and append that to self.items.
        item = {'name': name, 'price': price}
        self.item.append(item)

    def stock_price(self):
        # Add together all item prices in self.items and return the total.
        return sum([item['price'] for item in self.item])

In [15]:
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['New'] = df['H']+df['I']

In [17]:
df

          H         I         J         K       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [18]:
df

          H         I         J         K       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [19]:
df.drop('New', axis =1)

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          H         I         J         K       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [21]:
df.drop('New', axis = 1, inplace=True)

In [22]:
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
pd.Series(range(1,11))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [25]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [26]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [27]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [28]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [29]:
test = pd.Series(my_list)
test1 = pd.Series(d)

test2 = test + test1

In [30]:
test2

0   NaN
1   NaN
2   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [31]:
test

0    10
1    20
2    30
dtype: int64

In [32]:
test1

a    10
b    20
c    30
dtype: int64

In [33]:
test2 = test(data) + test1(data)

NameError: name 'data' is not defined

In [34]:
test2 = test + test1

In [35]:
test2

0   NaN
1   NaN
2   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

In [36]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [37]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
df.loc['E']

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: E, dtype: float64

In [41]:
df.iloc[2][1]

0.07295967531703869

In [42]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [43]:
newind = 'CA NY WY OR CO'.split()

In [45]:
df['New'] = newind

In [46]:
df

          W         X         Y         Z New
A  0.302665  1.693723 -1.706086 -1.159119  CA
B -0.134841  0.390528  0.166905  0.184502  NY
C  0.807706  0.072960  0.638787  0.329646  WY
D -0.497104 -0.754070 -0.943406  0.484752  OR
E -0.116773  1.901755  0.238127  1.996652  CO

In [51]:
df.set_index('New', inplace= True)

In [53]:
df.loc['CA']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: CA, dtype: float64

In [54]:
df

            W         X         Y         Z
New
CA   0.302665  1.693723 -1.706086 -1.159119
NY  -0.134841  0.390528  0.166905  0.184502
WY   0.807706  0.072960  0.638787  0.329646
OR  -0.497104 -0.754070 -0.943406  0.484752
CO  -0.116773  1.901755  0.238127  1.996652

In [55]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [56]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [61]:
df = pd.DataFrame(np.random.randn(6,2), index= hier_index, columns= ['A','B'])

In [62]:
df

             A         B
G1 1  0.666319 -0.538235
   2 -0.568581  1.407338
   3  0.641806 -0.905100
G2 1 -0.391157  1.028293
   2 -1.972605 -0.866885
   3  0.720788 -1.223082

In [66]:
df['A']

G1  1    0.666319
    2   -0.568581
    3    0.641806
G2  1   -0.391157
    2   -1.972605
    3    0.720788
Name: A, dtype: float64

In [67]:
df.loc['G1']

          A         B
1  0.666319 -0.538235
2 -0.568581  1.407338
3  0.641806 -0.905100

In [69]:
df.index.names

FrozenList([None, None])

In [70]:
df.index.names = ['Group','Num']

In [71]:
df

                  A         B
Group Num
G1    1    0.666319 -0.538235
      2   -0.568581  1.407338
      3    0.641806 -0.905100
G2    1   -0.391157  1.028293
      2   -1.972605 -0.866885
      3    0.720788 -1.223082

In [72]:
df.xs('G1')

            A         B
Num
1    0.666319 -0.538235
2   -0.568581  1.407338
3    0.641806 -0.905100

In [73]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [74]:
df = pd.DataFrame(data)

In [75]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [76]:
by_comp = df.groupby("Company")

In [81]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [82]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [83]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [90]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [91]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [92]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [93]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [94]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [95]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3